dangernoodle-io/breadboard/examples/elecrow-p4-hmi7/sdkconfig.defaults
# Target configuration
CONFIG_IDF_TARGET="esp32p4"

# ESP32-P4 silicon revision — this board has v1.3 (ECO2), NOT production rev-3.0.1+
# pioarduino's espidf.py would inject these for chip_variant=esp32p4_es but its
# write_sdkconfig_file early-returns on pure espidf framework. Set explicitly.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_1=y

# Flash configuration
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM configuration
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=n

# Console configuration
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# WiFi remote configuration
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y

# FreeRTOS configuration
CONFIG_FREERTOS_HZ=1000

# Logging configuration
CONFIG_LOG_DEFAULT_LEVEL=3
